In [1]:
import pandas as pd
import random

# Number of rows in the dataset
num_rows = 200

# Generate random values for the dataset
customer_ids = list(range(1, num_rows + 1))
genres = [random.choice(['Male', 'Female']) for _ in range(num_rows)]
age_groups = [random.choice(['Teen', 'Middle Age', 'Elder']) for _ in range(num_rows)]
ages = [random.randint(18, 80) for _ in range(num_rows)]
incomes = [random.randint(15, 150) * 1000 for _ in range(num_rows)]
spending_scores = [random.randint(1, 100) for _ in range(num_rows)]

# Create a DataFrame
data = {
    'CustomerID': customer_ids,
    'Genre': genres,
    'Age Group': age_groups,
    'Age': ages,
    'Annual Income (k$)': incomes,
    'Spending Score (1-100)': spending_scores
}

df = pd.DataFrame(data)

# Display the first few rows of the DataFrame
print(df.head())

   CustomerID   Genre   Age Group  Age  Annual Income (k$)  \
0           1    Male       Elder   46               21000
1           2    Male  Middle Age   60               76000
2           3  Female       Elder   23               40000
3           4  Female       Elder   73               46000
4           5    Male        Teen   65               57000

   Spending Score (1-100)
0                      33
1                      93
2                      93
3                      38
4                      22

In [2]:
df.info

<bound method DataFrame.info of      CustomerID   Genre   Age Group  Age  Annual Income (k$)  \
0             1    Male       Elder   46               21000
1             2    Male  Middle Age   60               76000
2             3  Female       Elder   23               40000
3             4  Female       Elder   73               46000
4             5    Male        Teen   65               57000
..          ...     ...         ...  ...                 ...
195         196  Female       Elder   55               78000
196         197  Female        Teen   19              141000
197         198    Male  Middle Age   72              130000
198         199    Male  Middle Age   34               17000
199         200  Female  Middle Age   39              102000

     Spending Score (1-100)
0                        33
1                        93
2                        93
3                        38
4                        22
..                      ...
195                      96
196                      22
197                      38
198                      27
199                      35

[200 rows x 6 columns]>

In [3]:
df.shape

(200, 6)

In [4]:
df.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   48.570000        75825.000000               50.330000
std     57.879185   17.860855        38791.989732               29.589675
min      1.000000   18.000000        15000.000000                1.000000
25%     50.750000   33.000000        40000.000000               23.750000
50%    100.500000   47.000000        73500.000000               46.000000
75%    150.250000   64.000000       109250.000000               79.250000
max    200.000000   80.000000       150000.000000              100.000000

In [5]:
df.Age.mean()

48.57

In [6]:
df.Age.mode()

0    44
Name: Age, dtype: int64

In [7]:
df.Age.median()

47.0

In [8]:
df.groupby(['Age']).count()

     CustomerID  Genre  Age Group  Annual Income (k$)  Spending Score (1-100)
Age
18            2      2          2                   2                       2
19            5      5          5                   5                       5
20            2      2          2                   2                       2
21            4      4          4                   4                       4
22            2      2          2                   2                       2
..          ...    ...        ...                 ...                     ...
76            4      4          4                   4                       4
77            6      6          6                   6                       6
78            2      2          2                   2                       2
79            2      2          2                   2                       2
80            1      1          1                   1                       1

[62 rows x 5 columns]

In [9]:
df.groupby(['Genre']).count()

        CustomerID  Age Group  Age  Annual Income (k$)  Spending Score (1-100)
Genre
Female          98         98   98                  98                      98
Male           102        102  102                 102                     102

In [10]:
df.Age.std()

17.86085526378199

In [11]:
df[['Age' , 'Annual Income (k$)', 'Spending Score (1-100)']].mean()

Age                          48.57
Annual Income (k$)        75825.00
Spending Score (1-100)       50.33
dtype: float64

In [12]:
df[['Age' , 'Annual Income (k$)', 'Spending Score (1-100)']].mode()

    Age  Annual Income (k$)  Spending Score (1-100)
0  44.0             48000.0                      22
1   NaN                 NaN                      23
2   NaN                 NaN                      81
3   NaN                 NaN                      95

In [13]:
df[['Age' , 'Annual Income (k$)', 'Spending Score (1-100)']].median()

Age                          47.0
Annual Income (k$)        73500.0
Spending Score (1-100)       46.0
dtype: float64

In [14]:
df[['Age' , 'Annual Income (k$)', 'Spending Score (1-100)']].max()

Age                           80
Annual Income (k$)        150000
Spending Score (1-100)       100
dtype: int64

In [15]:
df[['Age' , 'Annual Income (k$)', 'Spending Score (1-100)']].std()

Age                          17.860855
Annual Income (k$)        38791.989732
Spending Score (1-100)       29.589675
dtype: float64

In [16]:
df2 = df.groupby('Genre')

In [17]:
df

,CustomerID,Genre,Age Group,Age,Annual Income (k$),Spending Score (1-100)
0,1,Male,Elder,46,21000,33
1,2,Male,Middle Age,60,76000,93
2,3,Female,Elder,23,40000,93
3,4,Female,Elder,73,46000,38
4,5,Male,Teen,65,57000,22
...,...,...,...,...,...,...
195,196,Female,Elder,55,78000,96
196,197,Female,Teen,19,141000,22
197,198,Male,Middle Age,72,130000,38
198,199,Male,Middle Age,34,17000,27
199,200,Female,Middle Age,39,102000,35

In [18]:
for Genre, Genre_f in df2:
    print(Genre)
    print(Genre_f)

Female
     CustomerID   Genre   Age Group  Age  Annual Income (k$)  \
2             3  Female       Elder   23               40000
3             4  Female       Elder   73               46000
5             6  Female  Middle Age   41               29000
6             7  Female        Teen   44              119000
8             9  Female        Teen   22              100000
..          ...     ...         ...  ...                 ...
188         189  Female        Teen   47               48000
190         191  Female       Elder   69              108000
195         196  Female       Elder   55               78000
196         197  Female        Teen   19              141000
199         200  Female  Middle Age   39              102000

     Spending Score (1-100)
2                        93
3                        38
5                        86
6                        73
8                        88
..                      ...
188                       2
190                      83
195                      96
196                      22
199                      35

[98 rows x 6 columns]
Male
     CustomerID Genre   Age Group  Age  Annual Income (k$)  \
0             1  Male       Elder   46               21000
1             2  Male  Middle Age   60               76000
4             5  Male        Teen   65               57000
7             8  Male  Middle Age   26               49000
11           12  Male  Middle Age   42               49000
..          ...   ...         ...  ...                 ...
192         193  Male  Middle Age   52               75000
193         194  Male       Elder   41               48000
194         195  Male  Middle Age   46              133000
197         198  Male  Middle Age   72              130000
198         199  Male  Middle Age   34               17000

     Spending Score (1-100)
0                        33
1                        93
4                        22
7                        14
11                       43
..                      ...
192                      22
193                      97
194                      42
197                      38
198                      27

[102 rows x 6 columns]

In [19]:
df2.get_group('Male')

,CustomerID,Genre,Age Group,Age,Annual Income (k$),Spending Score (1-100)
0,1,Male,Elder,46,21000,33
1,2,Male,Middle Age,60,76000,93
4,5,Male,Teen,65,57000,22
7,8,Male,Middle Age,26,49000,14
11,12,Male,Middle Age,42,49000,43
...,...,...,...,...,...,...
192,193,Male,Middle Age,52,75000,22
193,194,Male,Elder,41,48000,97
194,195,Male,Middle Age,46,133000,42
197,198,Male,Middle Age,72,130000,38
198,199,Male,Middle Age,34,17000,27

In [20]:
df2.get_group('Female')

,CustomerID,Genre,Age Group,Age,Annual Income (k$),Spending Score (1-100)
2,3,Female,Elder,23,40000,93
3,4,Female,Elder,73,46000,38
5,6,Female,Middle Age,41,29000,86
6,7,Female,Teen,44,119000,73
8,9,Female,Teen,22,100000,88
...,...,...,...,...,...,...
188,189,Female,Teen,47,48000,2
190,191,Female,Elder,69,108000,83
195,196,Female,Elder,55,78000,96
196,197,Female,Teen,19,141000,22
199,200,Female,Middle Age,39,102000,35

In [21]:
df2[['Age' , 'Annual Income (k$)', 'Spending Score (1-100)']].median()

         Age  Annual Income (k$)  Spending Score (1-100)
Genre
Female  45.5             78000.0                    58.5
Male    51.5             71000.0                    39.0

In [22]:
df2[['Age' , 'Annual Income (k$)', 'Spending Score (1-100)']].mean()

              Age  Annual Income (k$)  Spending Score (1-100)
Genre
Female  46.816327        76979.591837               55.561224
Male    50.254902        74715.686275               45.303922

In [23]:
df2[['Age' , 'Annual Income (k$)', 'Spending Score (1-100)']].max()

        Age  Annual Income (k$)  Spending Score (1-100)
Genre
Female   80              150000                     100
Male     79              147000                     100

In [24]:
df2[['Age' , 'Annual Income (k$)', 'Spending Score (1-100)']].min()

        Age  Annual Income (k$)  Spending Score (1-100)
Genre
Female   18               15000                       1
Male     18               16000                       2

In [25]:
df2[['Age' , 'Annual Income (k$)', 'Spending Score (1-100)']].std()

              Age  Annual Income (k$)  Spending Score (1-100)
Genre
Female  17.861060        37807.701062               30.603236
Male    17.785124        39869.683128               27.812950

In [28]:
url = "https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv"

In [29]:
df3 = pd.read_csv(url)

In [30]:
df3

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [31]:
df4 =df3.groupby("variety")

In [32]:
df4

In [34]:
 df4.get_group("Setosa")

    sepal.length  sepal.width  petal.length  petal.width variety
0            5.1          3.5           1.4          0.2  Setosa
1            4.9          3.0           1.4          0.2  Setosa
2            4.7          3.2           1.3          0.2  Setosa
3            4.6          3.1           1.5          0.2  Setosa
4            5.0          3.6           1.4          0.2  Setosa
5            5.4          3.9           1.7          0.4  Setosa
6            4.6          3.4           1.4          0.3  Setosa
7            5.0          3.4           1.5          0.2  Setosa
8            4.4          2.9           1.4          0.2  Setosa
9            4.9          3.1           1.5          0.1  Setosa
10           5.4          3.7           1.5          0.2  Setosa
11           4.8          3.4           1.6          0.2  Setosa
12           4.8          3.0           1.4          0.1  Setosa
13           4.3          3.0           1.1          0.1  Setosa
14           5.8          4.0           1.2          0.2  Setosa
15           5.7          4.4           1.5          0.4  Setosa
16           5.4          3.9           1.3          0.4  Setosa
17           5.1          3.5           1.4          0.3  Setosa
18           5.7          3.8           1.7          0.3  Setosa
19           5.1          3.8           1.5          0.3  Setosa
20           5.4          3.4           1.7          0.2  Setosa
21           5.1          3.7           1.5          0.4  Setosa
22           4.6          3.6           1.0          0.2  Setosa
23           5.1          3.3           1.7          0.5  Setosa
24           4.8          3.4           1.9          0.2  Setosa
25           5.0          3.0           1.6          0.2  Setosa
26           5.0          3.4           1.6          0.4  Setosa
27           5.2          3.5           1.5          0.2  Setosa
28           5.2          3.4           1.4          0.2  Setosa
29           4.7          3.2           1.6          0.2  Setosa
30           4.8          3.1           1.6          0.2  Setosa
31           5.4          3.4           1.5          0.4  Setosa
32           5.2          4.1           1.5          0.1  Setosa
33           5.5          4.2           1.4          0.2  Setosa
34           4.9          3.1           1.5          0.2  Setosa
35           5.0          3.2           1.2          0.2  Setosa
36           5.5          3.5           1.3          0.2  Setosa
37           4.9          3.6           1.4          0.1  Setosa
38           4.4          3.0           1.3          0.2  Setosa
39           5.1          3.4           1.5          0.2  Setosa
40           5.0          3.5           1.3          0.3  Setosa
41           4.5          2.3           1.3          0.3  Setosa
42           4.4          3.2           1.3          0.2  Setosa
43           5.0          3.5           1.6          0.6  Setosa
44           5.1          3.8           1.9          0.4  Setosa
45           4.8          3.0           1.4          0.3  Setosa
46           5.1          3.8           1.6          0.2  Setosa
47           4.6          3.2           1.4          0.2  Setosa
48           5.3          3.7           1.5          0.2  Setosa
49           5.0          3.3           1.4          0.2  Setosa

In [35]:
 df4.get_group("Virginica")

     sepal.length  sepal.width  petal.length  petal.width    variety
100           6.3          3.3           6.0          2.5  Virginica
101           5.8          2.7           5.1          1.9  Virginica
102           7.1          3.0           5.9          2.1  Virginica
103           6.3          2.9           5.6          1.8  Virginica
104           6.5          3.0           5.8          2.2  Virginica
105           7.6          3.0           6.6          2.1  Virginica
106           4.9          2.5           4.5          1.7  Virginica
107           7.3          2.9           6.3          1.8  Virginica
108           6.7          2.5           5.8          1.8  Virginica
109           7.2          3.6           6.1          2.5  Virginica
110           6.5          3.2           5.1          2.0  Virginica
111           6.4          2.7           5.3          1.9  Virginica
112           6.8          3.0           5.5          2.1  Virginica
113           5.7          2.5           5.0          2.0  Virginica
114           5.8          2.8           5.1          2.4  Virginica
115           6.4          3.2           5.3          2.3  Virginica
116           6.5          3.0           5.5          1.8  Virginica
117           7.7          3.8           6.7          2.2  Virginica
118           7.7          2.6           6.9          2.3  Virginica
119           6.0          2.2           5.0          1.5  Virginica
120           6.9          3.2           5.7          2.3  Virginica
121           5.6          2.8           4.9          2.0  Virginica
122           7.7          2.8           6.7          2.0  Virginica
123           6.3          2.7           4.9          1.8  Virginica
124           6.7          3.3           5.7          2.1  Virginica
125           7.2          3.2           6.0          1.8  Virginica
126           6.2          2.8           4.8          1.8  Virginica
127           6.1          3.0           4.9          1.8  Virginica
128           6.4          2.8           5.6          2.1  Virginica
129           7.2          3.0           5.8          1.6  Virginica
130           7.4          2.8           6.1          1.9  Virginica
131           7.9          3.8           6.4          2.0  Virginica
132           6.4          2.8           5.6          2.2  Virginica
133           6.3          2.8           5.1          1.5  Virginica
134           6.1          2.6           5.6          1.4  Virginica
135           7.7          3.0           6.1          2.3  Virginica
136           6.3          3.4           5.6          2.4  Virginica
137           6.4          3.1           5.5          1.8  Virginica
138           6.0          3.0           4.8          1.8  Virginica
139           6.9          3.1           5.4          2.1  Virginica
140           6.7          3.1           5.6          2.4  Virginica
141           6.9          3.1           5.1          2.3  Virginica
142           5.8          2.7           5.1          1.9  Virginica
143           6.8          3.2           5.9          2.3  Virginica
144           6.7          3.3           5.7          2.5  Virginica
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [37]:
df4.mean()

            sepal.length  sepal.width  petal.length  petal.width
variety
Setosa             5.006        3.428         1.462        0.246
Versicolor         5.936        2.770         4.260        1.326
Virginica          6.588        2.974         5.552        2.026

In [38]:
df4.median()

            sepal.length  sepal.width  petal.length  petal.width
variety
Setosa               5.0          3.4          1.50          0.2
Versicolor           5.9          2.8          4.35          1.3
Virginica            6.5          3.0          5.55          2.0